# сетка 18000 * 60000

import matplotlib.pyplot as plt
import numpy as np

# Без -O3
t_1 = [10673340, 10588327, 10538848, 10560895, 10532554]
t_2 = [5340761, 5396008, 5350956, 5379006, 5449361]
t_3 = [3674890, 3755849, 3730297, 3639490, 3803973]
t_4 = [2821182, 3169388, 2888229, 2879701, 2962791]
t_5 = [2416669, 2470647, 2618708, 2484045, 2594288]
t_6 = [2217439, 2367943, 2653932, 2215768, 2296097]

# С -O3
t_1_O3 = [5005073, 5663609, 5292630, 5115305, 5162172]
t_2_O3 = [2706113, 2659090, 2691269, 2724158, 2696923]
t_3_O3 = [1904880, 1895654, 1849773, 1895223, 1881124]
t_4_O3 = [1488777, 1487883, 1464466, 1463437, 1575236]
t_5_O3 = [1358271, 1282394, 1351479, 1304234, 1325051]
t_6_O3 = [1177591, 1319297, 1187218, 1165169, 1349470]

def PrintSpeed (str, arrs):
    n = [1, 2, 3, 4, 5, 6]
    T = []
    for arr in arrs:
        T.append(sum(arr) / len(arr))
    
    T = np.array(T)
    S = T[0] / T
    E = S / n

    plt.rc ('font', size = 13)
    fig = plt.figure(figsize = (16, 8))
    ax1 = fig.add_subplot(1, 2, 1)
    ax1.plot(n, S)
    ax1.set_ylabel("S(n), " + str)
    ax1.grid()

    ax2 = fig.add_subplot(1, 2, 2)
    ax2.plot(n, E)
    ax2.set_ylabel("E(n), " + str)
    ax2.grid()
    fig.savefig(str + "_speed.pdf")

PrintSpeed ("without_O3", [t_1, t_2, t_3, t_4, t_5, t_6])
PrintSpeed ("with_O3", [t_1_O3, t_2_O3, t_3_O3, t_4_O3, t_5_O3, t_6_O3])
